 // + означава интервал 
 [A-Z][a-z]+

 // това означава да започва с главна буква да иама след това малка буква а + означва поне една малка буква след галвната.
 //ако искаме да намерим определен символ изпозваме ш backslach \[\] - да немри в текста []!!!

 // стойности които не искаме да маяваме - [^abc] = Abraham - не сиакме да хваща а,b, c

 // \w - хваща всички word charcters (a-z,A-Z,0-9_);

 // \W -хваща всички non word charcters слектира интервал, специални символи, точка, запетайка и $ , % и др.

 // \s - хваща всеки нов ред, интервал и space white space charcter;

 // \S - хваща всички non space white space charcter;

 // \d -хваща всички числа (0 - 9);
 // + - означава един или повече пъти стига да са едно до друго.
 // \d+
 // +359888440160 - \+\d+  - regex за това число числото е селктрирано един или повече пъти!!
     // ще селектира + и числата 
 // \d* ще бъде селектирано 0 или повече пъти!!

// \+\d*  тук може да слектира само плюса ако искаме да селектираме само плюс без числа.
  

 //  \d? - означава да селектира плюс или само първото число.

 // \d{4} - цифрата в скобата означава колко точно цифри да хваща в случея хваща 4 цифри.

 // Групиране  = 20-Jan-2022 - \d{2}.\w{2}.\d{4}

 // точка . означава any charcter ако се повтаря един или повеч пъти се пише .+  !!!